import { Card } from "../../../interfaces"
import Set from "../SV6"

const card: Card = {
	set: Set,

	name: {
		ja: "鬼の仮面",
		'zh-tw': "鬼之假面",
		th: "หน้ากากยักษ์"
	},

	category: "Trainer",
	rarity: "Uncommon",

	description: {

	},

	illustrator: "5ban Graphics",

	effect: {
		ja: "自分のトラッシュから、名前に「オーガポン」とつく「ポケモンex」を1枚選び、自分の場の、名前に「オーガポン」とつく「ポケモンex」1匹と入れ替える（ついているカード・ダメカン・特殊状態・効果などは、すべて引きつぐ）。入れ替えたポケモンはトラッシュする。",
		'zh-tw': "從自己的棄牌區選擇1張名稱中有「厄鬼椪」的「寶可夢【ex】」卡，與自己的場上的1隻名稱中有「厄鬼椪」的「寶可夢【ex】」互換（所附加的卡・傷害指示物・特殊狀態・效果等全部保留）。將換下的寶可夢丟棄。",
		th: "เลือกการ์ด [โปเกมอน【ex】] ที่มีคำว่า [โอการ์ปอง] บนชื่อ 1 ใบ จากตำแหน่งทิ้งการ์ดฝ่ายเรา สลับกับ [โปเกมอน【ex】] ที่มีคำว่า [โอการ์ปอง] บนชื่อ บนกระดานฝ่ายเรา 1 ตัว (การ์ดที่ติดอยู่ ตัวนับแดเมจ สภาวะผิดปกติ เอฟเฟกต์ทั้งหมดยังคงอยู่ต่อไป) ทิ้งโปเกมอนที่สลับที่ตำแหน่งทิ้งการ์ด"
	},

	trainerType: "Item",
	regulationMark: "H"
}

export default card