import { Card } from "../../../interfaces";
import Set from "../SV5M";

const card: Card = {
	set: Set,
	name: {
		ja: "セイジ",
		'zh-tw': "賽吉",
		th: "เซจ",
	},

	illustrator: "Ryuta Fuse",
	category: "Trainer",

	effect: {
		ja: "自分の場のポケモン1匹から進化するカード（特性を持つポケモンをのぞく）を、自分の山札から1枚選び、そのポケモンにのせて進化させる。そして山札を切る。（対戦準備で出したポケモンや、この番出したばかりのポケモンにも使える。）",
		'zh-tw': "從自己的牌庫選擇1張自己的1隻場上寶可夢進化而來的卡（擁有特性的寶可夢除外），放置於那隻寶可夢身上完成進化。並且重洗牌庫。（對對戰準備時使出的寶可夢或這個回合剛使出的寶可夢也可使用。）",
		th: "เลือกการ์ดที่จะวิวัฒนาการจากโปเกมอน 1 ตัวบนกระดานฝ่ายเรา (ยกเว้นโปเกมอนที่มีความสามารถ) 1 ใบจากสำรับการ์ดฝ่ายเรา วางบนโปเกมอนนั้นเพื่อวิวัฒนาการ แล้วสับสำรับการ์ด (โปเกมอนที่วางเพื่อเตรียมแบตเทิล และโปเกมอนที่เพิ่งออกมาในเทิร์นนี้ก็ใช้ได้)",
	},

	variants: [
		{
			type: "holo",
			thirdParty: {
				cardmarket: 752975,
				tcgplayer: 566242,
			},
		},
	],

	trainerType: "Supporter",
	regulationMark: "H",
	rarity: "Ultra Rare",
};

export default card;
