import { Card } from "../../../interfaces"
import Set from "../S12a"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "光輝甲賀忍蛙",
		th: "เรเดียนต์เก็คโคกะ"
	},

	illustrator: "Souichirou Gunjima",
	category: "Pokemon",
	hp: 130,
	types: ["Water"],

	description: {
		'zh-tw': "如忍者般神出鬼沒。以敏捷的動作戲弄對手， 再用水之手裡劍將其劈裂。",
		th: "ผลุบโผล่ไปมาราวกับนินจา จะเคลื่อนไหวอย่างรวดเร็วเพื่อหลอกล่อแล้วเชือดเฉือนด้วยดาวกระจายน้ำ"
	},

	stage: "Basic",

	abilities: [{
		type: "Ability",

		name: {
			'zh-tw': "隱藏牌",
			th: "การ์ดที่ซ่อนอยู่"
		},

		effect: {
			'zh-tw': "在自己的回合，若從自己的手牌將1張能量卡丟棄，則可使用1次。從自己的牌庫抽出2張卡。",
			th: "ในเทิร์นฝ่ายเรา ถ้าทิ้งการ์ดพลังงาน 1 ใบจากบนมือฝ่ายเราที่ตำแหน่งทิ้งการ์ด จะสามารถใช้ได้ 1 ครั้ง จั่วการ์ด 2 ใบจากสำรับการ์ดฝ่ายเรา"
		}
	}],

	attacks: [{
		name: {
			'zh-tw': "月光手裏劍",
			th: "ดาวกระจายแสงจันทร์"
		},

		effect: {
			'zh-tw': "將這隻寶可夢身上附加的2個能量丟棄，對手的2隻寶可夢各受到90點傷害。[在備戰區不計算弱點・抵抗力。]",
			th: "ทิ้งพลังงานที่ติดอยู่กับโปเกมอนนี้ 2 ลูกที่ตำแหน่งทิ้งการ์ดและโปเกมอนฝ่ายตรงข้าม 2 ตัว จะได้รับแดเมจตัวละ 90 {โปเกมอนบนเบนช์จะไม่นำจุดอ่อนและความต้านทานมาคิด}"
		},

		cost: ["Water", "Water", "Colorless"]
	}],

	weaknesses: [{
		type: "Lightning",
		value: "×2"
	}],

	retreat: 1,
	regulationMark: "F"
}

export default card