import { Card } from "../../../interfaces"
import Set from "../S12a"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "堅毅十字鎬",
		th: "อีเต้อกล้าหาญ",
		ja: "ガッツのつるはし"
	},

	illustrator: "Eske Yoshinob",
	category: "Trainer",

	effect: {
		'zh-tw': "將自己的牌庫上方1張卡翻到正面，若那張卡為【鬥】能量卡，則附於自己的備戰寶可夢身上。若不為【鬥】能量卡，則在給對手看過後加入手牌。",
		th: "หงายการ์ด 1 ใบจากด้านบนของสำรับการ์ดฝ่ายเรา ถ้าการ์ดนั้นเป็นการ์ดพลังงาน[ต่อสู้] ติดที่โปเกมอนบนเบนช์ฝ่ายเรา ถ้าไม่ใช่การ์ดพลังงาน[ต่อสู้] ให้ฝ่ายตรงข้ามดู แล้วนำขึ้นมือ",
		ja: "自分の山札を上から1枚オモテにして、そのカードがエネルギーなら、自分のベンチポケモンにつける。エネルギーでないなら、相手に見せて、手札に加える。"
	},

	trainerType: "Item",
	regulationMark: "F"
}

export default card