import { Card } from "../../../interfaces"
import Set from "../S12a"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "洗翠的沉重球",
		th: "เฮฟวีบอลแห่งฮิซุย"
	},

	illustrator: "Studio Bora Inc.",
	category: "Trainer",

	effect: {
		'zh-tw': "查看自己的所有反面朝上的獎賞卡的正面。從其中選擇1張【基礎】寶可夢卡，在給對手看過後，與這張「洗翠的沉重球」卡互換並加入手牌。將看過的獎賞卡與換入的卡全部翻回反面並重洗，作為獎賞卡放置。",
		th: "ดูหน้าการ์ดรางวัลที่คว่ำไว้ทั้งหมดของฝ่ายเรา เลือกการ์ดโปเกมอน[พื้นฐาน] 1 ใบจากในนั้น ให้ฝ่ายตรงข้ามดู สลับกับการ์ด [เฮฟวีบอลแห่งฮิซุย] นี้ นำขึ้นมือ คว่ำการ์ดรางวัลที่ดูและการ์ดที่สลับทั้งหมด สับการ์ดแล้ววางไว้เป็นการ์ดรางวัล"
	},

	trainerType: "Item",
	regulationMark: "F"
}

export default card