import { Card } from "../../../interfaces"
import Set from "../S12a"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "放逐吸塵器",
		th: "ลอสต์สวีปเปอร์",
		ja: "ロストスイーパー"
	},

	illustrator: "Amelicart",
	category: "Trainer",

	effect: {
		'zh-tw': "這張卡必須將自己的1張手牌放置於放逐區才可使用。從雙方的場上寶可夢身上附加的「寶可夢道具」卡與場上的「競技場」卡中選擇1張，放置於放逐區。",
		th: "การ์ดนี้ ถ้าไม่วางการ์ดบนมือฝ่ายเรา 1 ใบที่ลอสต์โซน จะใช้ไม่ได้ เลือกการ์ด 1 ใบจากใน ที่ติดอยู่กับโปเกมอนบนกระดานของทั้งสองฝ่าย หรือการ์ด ที่อยู่บนกระดาน วางไว้ที่ลอสต์โซน",
		ja: "このカードは、自分の手札を1枚、ロストゾーンに置かなければ使えない。\n\nおたがいの場のポケモンについている「ポケモンのどうぐ」と場に出ている「スタジアム」の中から1枚選び、ロストゾーンに置く。"
	},

	trainerType: "Item",
	regulationMark: "F"
}

export default card