import { Card } from "../../../interfaces"
import Set from "../S12a"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "崩塌的競技場",
		th: "สเตเดียมที่พังทลาย"
	},

	illustrator: "Oswaldo KATO",
	category: "Trainer",

	effect: {
		'zh-tw': "雙方玩家的可放置於備戰區的寶可夢數量改為4隻。[變更備戰寶可夢數量的效果，以變少者為優先。] （將這張卡放置於場上時，備戰寶可夢有5隻以上的玩家，將其丟棄直到變為4隻為止。這張卡的持有人先丟棄。）",
		th: "จำนวนโปเกมอนที่ผู้เล่นทั้งสองฝ่ายสามารถวางบนเบนช์ได้จะเป็น 4 ตัว [เอฟเฟกต์เปลี่ยนจำนวนโปเกมอนบนเบนช์ ให้ยึดเอาจำนวนที่น้อยกว่าเป็นหลัก] (เมื่อการ์ดนี้วางบนกระดาน ให้ผู้เล่นที่มีโปเกมอนบนเบนช์มากกว่าหรือเท่ากับ 5 ตัว ทิ้งจนเหลือ 4 ตัวที่ตำแหน่งทิ้งการ์ด เริ่มทิ้งจากเจ้าของการ์ดนี้)"
	},

	trainerType: "Stadium",
	regulationMark: "F"
}

export default card