import { Card } from "../../../interfaces"
import Set from "../S12a"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "匯流能量",
		th: "พลังงานจู่โจมแบบฟิวชัน",
		ja: "フュージョンエネルギー"
	},

	category: "Energy",

	effect: {
		'zh-tw': "這張卡只可附於「匯流」寶可夢身上，若附於「匯流」寶可夢以外的寶可夢身上，則將其丟棄。 只要這張卡附於寶可夢身上，視為提供1個所有屬性的能量，附有這張卡的寶可夢，不會受到對手的寶可夢的特性效果影響。",
		th: "การ์ดนี้สามารถติดได้ที่โปเกมอน เท่านั้น ถ้าติดอยู่ที่โปเกมอนอื่นนอกเหนือจาก ให้ทิ้งที่ตำแหน่งทิ้งการ์ด การ์ดนี้ ตราบใดที่ติดอยู่กับโปเกมอนจะทำงานเทียบเท่าพลังงานทุกประเภท 1 ลูก โปเกมอนที่ติดการ์ดนี้อยู่จะไม่ได้รับเอฟเฟกต์จากความสามารถของ โปเกมอนฝ่ายตรงข้าม",
		ja: "このカードは「フュージョン」のポケモンにしかつけられず、「フュージョン」のポケモン以外についているなら、トラッシュする。\n\nこのカードは、ポケモンについているかぎり、すべてのタイプのエネルギー1個ぶんとしてはたらき、このカードをつけているポケモンは、相手のポケモンから特性の効果を受けない。"
	},

	energyType: "Special",
	regulationMark: "E"
}

export default card