import { Card } from "../../../interfaces"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		ja: "バクーダ",
		'zh-tw': "噴火駝",
		th: "บาคูดา",
		ko: "폭타"
	},

	illustrator: "satoma",
	rarity: "Uncommon",
	category: "Pokemon",
	dexId: [323],
	hp: 130,
	types: ["Fire"],

	description: {
		ja: "火山の 火口で 生活する。 １０年ごとに 背中の コブが 大噴火することで 有名だ。",
		'zh-tw': "平時生活在火山口。以背上的駝峰每１０年 會大爆發一次而聞名。",
		th: "อาศัยอยู่บริเวณปากปล่องภูเขาไฟ ขึ้นชื่อเรื่องภูเขาไฟที่หนอกบนกลางหลังระเบิดครั้งใหญ่ทุก 10 ปี",
		ko: "화산의 분화구에서 생활한다. 10년마다 등의 혹이 대분화하는 것으로 유명하다."
	},

	stage: "Stage1",

	attacks: [{
		cost: ["Fire"],

		name: {
			ja: "ほのおでこがす",
			'zh-tw': "火焰灼燒",
			th: "ลนไฟ",
			ko: "불꽃으로 그을리기"
		},

		effect: {
			ja: "相手のバトルポケモンをやけどにする。",
			'zh-tw': "將對手的戰鬥寶可夢【灼傷】。",
			th: "ทำให้โปเกมอนบนตำแหน่งต่อสู้ฝ่ายตรงข้ามเป็นสภาวะ[ไหม้]",
			ko: "상대의 배틀 포켓몬을 화상으로 만든다."
		}
	}, {
		cost: ["Fire", "Fire", "Colorless"],

		name: {
			ja: "ふんせきキャノン",
			'zh-tw': "火山岩加農炮",
			th: "ปืนใหญ่กรวดภูเขาไฟ",
			ko: "분석캐논"
		},

		damage: "120+",

		effect: {
			ja: "のぞむなら、このポケモンについているエネルギーを1個選び、トラッシュする。その場合、120ダメージ追加。",
			'zh-tw': "若希望，選擇1個這隻寶可夢身上附加的【鬥】能量，將其丟棄。這個情況下，增加120點傷害。",
			th: "หากต้องการ เลือกพลังงาน[ต่อสู้]ที่ติดอยู่กับโปเกมอนนี้ 1 ลูก ทิ้งที่ตำแหน่งทิ้งการ์ด เมื่อทำเช่นนั้นแล้ว การโจมตีนี้จะเพิ่มแดเมจอีก 120",
			ko: "원한다면 이 포켓몬에게 붙어 있는 (격투) 에너지를 1개 선택해서 트래쉬한다. 그 경우, 120데미지를 추가한다."
		}
	}],

	weaknesses: [{
		type: "Water",
		value: "×2"
	}],

	retreat: 3,
	regulationMark: "G",

	thirdParty: {
		cardmarket: 741253
	}
}

export default card