import { Card } from "../../../interfaces"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		ja: "イーユイ",
		'zh-tw': "古玉魚",
		th: "อวี้อวี๋",
		ko: "위유이"
	},

	illustrator: "Oswaldo KATO",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [1004],
	hp: 110,
	types: ["Fire"],

	description: {
		ja: "３０００度の 炎を 操る。 岩や 砂利を 溶かして 作った マグマの海を ゆうゆうと 泳ぐ。",
		'zh-tw': "能操控３０００度的火焰。會熔化岩石和沙礫做成熔岩海， 並在裡面悠閒自在地游泳。",
		th: "ควบคุมเปลวไฟที่ร้อนกว่า 3000 องศาเซลเซียส แหวกว่ายในทะเลแม็กมาที่มันสร้างจากการหลอมละลายหินและกรวดอย่างสบาย ๆ",
		ko: "3000도의 불꽃을 조종한다. 바위와 자갈을 녹여서 만든 마그마의 바다를 유유히 헤엄친다."
	},

	stage: "Basic",

	attacks: [{
		cost: ["Fire"],

		name: {
			ja: "フレアブリング",
			'zh-tw': "閃焰到來",
			th: "เบิกเปลวเพลิง",
			ko: "플레어브링"
		},

		effect: {
			ja: "自分のトラッシュから「基本エネルギー」を2枚まで選び、自分のポケモン1匹につける。",
			'zh-tw': "從自己的棄牌區選擇最多2張「基本【火】能量」卡，附於自己的1隻寶可夢身上。",
			th: "เลือกการ์ด [พลังงานพื้นฐาน[ไฟ]] ได้สูงสุด 2 ใบจากตำแหน่งทิ้งการ์ดฝ่ายเรา ติดที่โปเกมอนฝ่ายเรา 1 ตัว",
			ko: "자신의 트래쉬에서 「기본 (불꽃) 에너지」를 2장까지 선택해서 자신의 포켓몬 1마리에게 붙인다."
		}
	}, {
		cost: ["Fire", "Fire"],

		name: {
			ja: "ねたみのごうか",
			'zh-tw': "嫉妒業火",
			th: "ไฟนรกแห่งความอิจฉา",
			ko: "시기의겁화"
		},

		damage: "50+",

		effect: {
			ja: "前の相手の番に、ワザのダメージで、自分のポケモンがきぜつしていたなら、90ダメージ追加。",
			'zh-tw': "在上個對手的回合，若自己的寶可夢因招式的傷害而【昏厥】了，則增加90點傷害。",
			th: "ในเทิร์นก่อนของฝ่ายตรงข้าม ถ้าโปเกมอนฝ่ายเรา[หมดสภาพ] ด้วยแดเมจของท่าต่อสู้ การโจมตีนี้จะเพิ่มแดเมจอีก 90",
			ko: "상대의 이전 차례에 기술의 데미지로 자신의 포켓몬이 기절했다면 90데미지를 추가한다."
		}
	}],

	weaknesses: [{
		type: "Water",
		value: "×2"
	}],

	retreat: 1,
	regulationMark: "G"
}

export default card