import { Card } from "../../../interfaces"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		ja: "ディンルー",
		'zh-tw': "古鼎鹿",
		th: "ติ่งลู่",
		ko: "딩루"
	},

	illustrator: "AKIRA EGAWA",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [1003],
	hp: 140,
	types: ["Fighting"],

	description: {
		ja: "古の 儀式で 使われた 器に 注がれた 恐怖が 土石を まとい ポケモンとなった。",
		'zh-tw': "古老儀式用的容器中注入的恐懼把土石裹在自己身上， 變成了寶可夢。",
		th: "ความหวาดกลัวที่โดนเทลงในภาชนะที่ใช้ในพิธีกรรมเก่าแก่ถูกห่อหุ้มด้วยดินและหิน จนกลายเป็นโปเกมอน",
		ko: "옛날 의식에 사용되었던 그릇에 공포가 깃들게 되었고 이것이 흙과 돌을 둘러 포켓몬이 되었다."
	},

	stage: "Basic",

	attacks: [{
		cost: ["Fighting"],

		name: {
			ja: "サンドブリング",
			'zh-tw': "沙之到來",
			th: "เบิกทราย",
			ko: "샌드브링"
		},

		effect: {
			ja: "自分のトラッシュから「基本エネルギー」を2枚まで選び、自分のポケモン1匹につける。",
			'zh-tw': "從自己的棄牌區選擇最多2張「基本【鬥】能量」卡，附於自己的1隻寶可夢身上。",
			th: "เลือกการ์ด [พลังงานพื้นฐาน[ต่อสู้]] ได้สูงสุด 2 ใบจากตำแหน่งทิ้งการ์ดฝ่ายเรา ติดที่โปเกมอนฝ่ายเรา 1 ตัว",
			ko: "자신의 트래쉬에서 「기본 (격투) 에너지」를 2장까지 선택해서 자신의 포켓몬 1마리에게 붙인다."
		}
	}, {
		cost: ["Fighting", "Fighting", "Fighting"],

		name: {
			ja: "ごうまんインパクト",
			'zh-tw': "傲慢衝擊",
			th: "อวดดีพุ่งชน",
			ko: "거만임팩트"
		},

		damage: 220,

		effect: {
			ja: "このポケモンにダメカンが4個以上のっているなら、このワザは失敗。",
			'zh-tw': "若這隻寶可夢身上放置有4個以上的傷害指示物，則這個招式失敗。",
			th: "ถ้าโปเกมอนนี้มีตัวนับแดเมจวางอยู่มากกว่าหรือเท่ากับ 4 ตัว ท่าต่อสู้นี้จะล้มเหลว",
			ko: "이 포켓몬에게 데미지 카운터가 4개 이상 올려져 있다면 이 기술은 실패한다."
		}
	}],

	weaknesses: [{
		type: "Grass",
		value: "×2"
	}],

	retreat: 4,
	regulationMark: "G"
}

export default card