import { Card } from "../../../interfaces"
import Set from "../sv4K"

const card: Card = {
	set: Set,

	name: {
		ja: "カビゴンドール",
		'zh-tw': "卡比獸娃娃",
		th: "ตุ๊กตาคาบิกอน"
	},

	illustrator: "AYUMI ODASHIMA",
	rarity: "Uncommon",
	category: "Trainer",
	hp: 120,

	effect: {
		ja: "対戦準備でポケモンを場に出すとき、このカードが手札にあるなら、このカードをHP120のタイプのたねポケモンとして、ウラにして場に出してよい。（このカードは、対戦準備以外では場に出せない。）\n自分の番の中でなら、場に出ているこのカードをトラッシュできる。\n\nこのカードは、特殊状態にならず、にげられない。このカードがきぜつしても、相手はサイドをとれない。",
		'zh-tw': "進行對戰準備將寶可夢放置於場上時，若手牌有這張卡，則可將這張卡作為HP120的【無】屬性的【基礎】寶可夢，翻回反面放置於場上。（這張卡在對戰準備以外無法放置於場上。）若在自己的回合中，則可將場上的這張卡丟棄。 這張卡不會陷入特殊狀態，無法撤退。就算這張卡【昏厥】，對手也無法獲得獎賞卡。",
		th: "เมื่อจะวางโปเกมอนบนกระดานเพื่อเตรียมแบตเทิล ถ้าการ์ดนี้อยู่บนมือ จะนำการ์ดนี้ออกมาวางคว่ำไว้บนกระดาน เทียบเท่ากับโปเกมอน[พื้นฐาน]ประเภท[ไร้สี]ที่มี HP 120 ก็ได้ (การ์ดนี้ นอกเหนือจากตอนเตรียมแบตเทิลแล้วจะนำออกมาวางบนกระดานไม่ได้) ถ้าอยู่ภายในเทิร์นฝ่ายเรา จะทิ้งการ์ดนี้ที่วางอยู่บนกระดานที่ตำแหน่งทิ้งการ์ดได้ การ์ดนี้ จะไม่เป็นสภาวะผิดปกติ และจะหนีไม่ได้ แม้การ์ดนี้[หมดสภาพ] ฝ่ายตรงข้ามไม่สามารถหยิบการ์ดรางวัลได้"
	},

	trainerType: "Item",
	regulationMark: "G"
}

export default card