import { Card } from "../../../interfaces"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		ja: "大地の器",
		'zh-tw': "大地之容器",
		th: "ภาชนะแห่งผืนปฐพี",
		ko: "잠만보인형"
	},

	illustrator: "AYUMI ODASHIMA",
	rarity: "Uncommon",
	category: "Trainer",

	effect: {
		ja: "このカードは、自分の手札を1枚トラッシュしなければ使えない。\n\n自分の山札から基本エネルギーを2枚まで選び、相手に見せて、手札に加える。そして山札を切る。",
		'zh-tw': "這張卡必須將自己的1張手牌丟棄才可使用。 從自己的牌庫選擇最多2張基本能量卡，在給對手看過後加入手牌。並且重洗牌庫。",
		th: "การ์ดนี้ ถ้าไม่ทิ้งการ์ดบนมือฝ่ายเรา 1 ใบที่ตำแหน่งทิ้งการ์ดจะใช้ไม่ได้ เลือกการ์ดพลังงานพื้นฐานได้สูงสุด 2 ใบจากสำรับการ์ดฝ่ายเรา ให้ฝ่ายตรงข้ามดู นำขึ้นมือ แล้วสับสำรับการ์ด",
		ko: "대전 준비에서 포켓몬을 필드에 내보낼 때 이 카드가 패에 있다면 이 카드를 HP120의 (무색) 타입의 기본 포켓몬으로서 뒷면으로 하여 필드에 내보내도 좋다. (이 카드는 대전 준비 때 이외에는 필드에 내보낼 수 없다.) 자신의 차례라면 필드에 나와 있는 이 카드를 트래쉬할 수 있다. 이 카드는 특수 상태가 되지 않으며 후퇴할 수 없다. 이 카드가 기절해도 상대는 프라이즈를 가져갈 수 없다."
	},

	trainerType: "Item",
	regulationMark: "G"
}

export default card