import { Card } from "../../../interfaces"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		ja: "ブーストエナジー 古代",
		'zh-tw': "驅勁能量 古代",
		th: "บูสต์เอนเนอร์จี้ โบราณ",
		ko: "기술머신 데볼루션"
	},

	illustrator: "5ban Graphics",
	rarity: "Uncommon",
	category: "Trainer",

	effect: {
		ja: "このカードをつけている「古代」のポケモンは、最大HPが「+60」され、そのポケモンは、特殊状態にならず、受けている特殊状態は、すべて回復する。",
		'zh-tw': "附有這張卡的「古代」寶可夢的最大HP「+60」，那隻寶可夢不會陷入特殊狀態，並將受到的特殊狀態全部恢復。",
		th: "โปเกมอน [โบราณ] ที่ติดการ์ดนี้อยู่ HP สูงสุดจะถูก [+60] โปเกมอนนั้น จะไม่เป็นสภาวะผิดปกติ และจะหายจากสภาวะผิดปกติทั้งหมดที่ได้รับมา",
		ko: "이 카드를 붙이고 있는 포켓몬은 이 카드에 적혀 있는 기술을 사용할 수 있다. (기술을 사용하기 위한 에너지는 필요하다.) 포켓몬에게 붙어 있는 이 카드는 자신의 차례의 마지막에 트래쉬한다."
	},

	trainerType: "Tool",
	regulationMark: "G"
}

export default card