import { Card } from "../../../interfaces"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		ja: "オーリム博士の気迫",
		'zh-tw': "奧琳博士的氣魄",
		th: "จิตมุ่งมั่นของศาสตราจารย์โอลิม",
		ko: "멜로코"
	},

	illustrator: "Megumi Mizutani",
	rarity: "Uncommon",
	category: "Trainer",

	effect: {
		ja: "自分の「古代」のポケモンを2匹まで選び、トラッシュから基本エネルギーを1枚ずつつける。その後、自分の山札を3枚引く。",
		'zh-tw': "選擇最多2隻自己的「古代」寶可夢，從棄牌區附給那些寶可夢各1張基本能量卡。然後，從自己的牌庫抽出3張卡。",
		th: "เลือกโปเกมอน [โบราณ] ฝ่ายเราได้สูงสุด 2 ตัว นำการ์ดพลังงานพื้นฐานจากตำแหน่งทิ้งการ์ดมาติดตัวละ 1 ใบ หลังจากนั้น จั่วการ์ด 3 ใบจากสำรับการ์ดฝ่ายเรา",
		ko: "이 카드는 상대의 이전 차례에 자신의 포켓몬이 기절하지 않으면 사용할 수 없다. 자신의 트래쉬에서 「기본 (불꽃) 에너지」를 1장 선택해서 자신의 포켓몬에게 붙인다. 그 뒤, 자신의 패가 6장이 되도록 덱을 뽑는다."
	},

	trainerType: "Supporter",
	regulationMark: "G"
}

export default card