import { Card } from "../../../interfaces";
import Set from "../SV5M";

const card: Card = {
	set: Set,
	name: {
		ja: "ヘビーバトン",
		'zh-tw': "沉重接力棒",
		th: "คทาหนักอึ้ง",
	},

	illustrator: "Ayaka Yoshida",
	category: "Trainer",

	effect: {
		ja: "このカードをつけているにげるためのエネルギーが4個のポケモンが、バトル場で相手のポケモンからワザのダメージを受けてきぜつしたとき、そのポケモンについている基本エネルギーを3枚まで選び、自分のベンチポケモンに好きなようにつけ替える。",
		'zh-tw': "附有這張卡的【撤退】所需的能量為4個的寶可夢，在戰鬥場上受到對手的寶可夢招式的傷害而【昏厥】時，選擇最多3張那隻寶可夢身上附加的基本能量卡，以任意方式改附於自己的備戰寶可夢身上。",
		th: "เมื่อโปเกมอนที่มีพลังงานสำหรับ[หนี] 4 ลูกที่ติดการ์ดนี้อยู่ อยู่บนตำแหน่งต่อสู้และได้รับแดเมจของท่าต่อสู้จากโปเกมอนฝ่ายตรงข้ามและ[หมดสภาพ]แล้ว เลือกการ์ดพลังงานพื้นฐานที่ติดอยู่กับโปเกมอนนั้นได้สูงสุด 3 ใบ ย้ายไปติดกับโปเกมอนบนเบนช์ฝ่ายเราตามชอบ",
	},

	variants: [
		{
			type: "normal",
			thirdParty: {
				cardmarket: 752950,
				tcgplayer: 566217,
			},
		},
	],

	trainerType: "Tool",
	regulationMark: "H",
	rarity: "Uncommon",
};

export default card;
