import { Card } from "models/database/card"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		'ja-jp': "ミロカロス",
		'zh-tw': "美納斯",
		'th-th': "มิโลคารอส",
		'ko-kr': "밀로틱"
	},

	illustrator: "Atsuya Uki",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [350],
	hp: 120,
	types: ["Water"],

	description: {
		'ja-jp': "ミロカロスの 美しい 姿を 見た 者は 荒んだ 心が 癒されると いわれている。",
		'zh-tw': "據說目睹了美納斯美麗身姿的人，心中一切的憤恨都能得到撫慰。",
		'th-th': "ว่ากันว่าผู้เห็นร่างอันสวยงามของมิโลคารอส จะช่วยสงบจิตใจอันรุ่มร้อนลงได้",
		'ko-kr': "밀로틱의 아름다운 모습을 본 자는 황폐해진 마음이 치유된다고 한다."
	},

	stage: "Stage1",

	abilities: [{
		type: "Ability",

		name: {
			'ja-jp': "たすけぶね",
			'zh-tw': "慷慨解囊",
			'th-th': "เรือชูชีพ",
			'ko-kr': "구조선"
		},

		effect: {
			'ja-jp': "自分の番に、このカードを手札から出して進化させたとき、1回使える。おたがいのプレイヤーは、それぞれ自分のトラッシュからたねポケモンを1枚選び、自分のベンチに出す。（ベンチに出すのは相手から行う。）",
			'zh-tw': "在自己的回合，從手牌使出這張卡並完成進化時，可使用1次。雙方玩家各從自己的棄牌區選擇1張【基礎】寶可夢卡，放置於自己的備戰區。（由對手先進行放置。）",
			'th-th': "ในเทิร์นฝ่ายเรา เมื่อนำการ์ดนี้จากบนมือออกมาวิวัฒนาการแล้ว ใช้ได้ 1 ครั้ง ผู้เล่นทั้งสองฝ่าย แต่ละฝ่ายเลือกการ์ดโปเกมอน[พื้นฐาน] 1 ใบจากตำแหน่งทิ้งการ์ดฝ่ายตัวเอง วางบนเบนช์ฝ่ายตัวเอง (ฝ่ายตรงข้ามเริ่มวางโปเกมอนบนเบนช์ก่อน)",
			'ko-kr': "자신의 차례에 이 카드를 패에서 꺼내서 진화시켰을 때 1번 사용할 수 있다. 서로의 플레이어는 각각 자신의 트래쉬에서 기본 포켓몬을 1장 선택해서 자신의 벤치로 내보낸다. (벤치로 내보내는 것은 상대부터 한다.)"
		}
	}],

	attacks: [{
		cost: ["Water", "Colorless"],

		name: {
			'ja-jp': "ヒプノスプラッシュ",
			'zh-tw': "昏睡飛濺",
			'th-th': "ฮิปโนสแปลช",
			'ko-kr': "히프노 스플래시"
		},

		damage: 60,

		effect: {
			'ja-jp': "相手のバトルポケモンをねむりにする。",
			'zh-tw': "將對手的戰鬥寶可夢【睡眠】。",
			'th-th': "ทำให้โปเกมอนบนตำแหน่งต่อสู้ฝ่ายตรงข้ามเป็นสภาวะ[หลับ]",
			'ko-kr': "상대의 배틀 포켓몬을 잠듦으로 만든다."
		}
	}],

	weaknesses: [{
		type: "Lightning",
		value: "×2"
	}],

	variants: [
		{
			type: "holo",
			thirdParty: {
				cardmarket: 741841,
				tcgplayer: 565974,
			},
		},
	],

	retreat: 2,
	regulationMark: "G",
}

export default card