import { Card } from "models/database/card"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		'ja-jp': "ポリゴンZ",
		'zh-tw': "多邊獸Ｚ",
		'th-th': "โพรีกอน-แซด",
		'ko-kr': "폴리곤Z"
	},

	illustrator: "hatachu",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [474],
	hp: 150,
	types: ["Colorless"],

	description: {
		'ja-jp': "追加 プログラムで 進化したと 言われるが ほんとうに 進化なのか 学会でも 意見が 分かれる。",
		'zh-tw': "據說是在追加程式後進化了，但牠的改變是否真的是進化，在學術界也是意見分歧。",
		'th-th': "#N/A",
		'ko-kr': "추가 프로그램으로 진화했다고 전해지지만 정말 진화인 건지 학회에서도 의견이 나뉜다."
	},

	stage: "Stage2",

	abilities: [{
		type: "Ability",

		name: {
			'ja-jp': "バグターボ",
			'zh-tw': "漏洞渦輪",
			'th-th': "บั๊กเทอร์โบ",
			'ko-kr': "버그 터보"
		},

		effect: {
			'ja-jp': "自分の番に1回使える。コインを1回投げオモテなら、自分のトラッシュから基本エネルギーを4枚まで選び、このポケモンにつける。ウラなら、このポケモンについているエネルギーを1個選び、トラッシュする。",
			'zh-tw': "在自己的回合時可使用1次。擲1次硬幣若為正面，則從自己的棄牌區選擇最多4張基本能量卡，附於這隻寶可夢身上。若為反面，則選擇1個這隻寶可夢身上附加的能量，將其丟棄。",
			'th-th': "ใช้ได้ 1 ครั้งในเทิร์นฝ่ายเรา ทอยเหรียญ 1 ครั้งถ้าออกหัว เลือกการ์ดพลังงานพื้นฐานได้สูงสุด 4 ใบจากตำแหน่งทิ้งการ์ดฝ่ายเรา ติดที่โปเกมอนนี้ ถ้าออกก้อย เลือกพลังงานที่ติดอยู่กับโปเกมอนนี้ 1 ลูก ทิ้งที่ตำแหน่งทิ้งการ์ด",
			'ko-kr': "자신의 차례에 1번 사용할 수 있다. 동전을 1번 던져서 앞면이 나오면 자신의 트래쉬에서 기본 에너지를 4장까지 선택해서 이 포켓몬에게 붙인다. 뒷면이 나오면 이 포켓몬에게 붙어 있는 에너지를 1개 선택해서 트래쉬한다."
		}
	}],

	attacks: [{
		cost: ["Colorless"],

		name: {
			'ja-jp': "エナジーアタック",
			'zh-tw': "能量攻擊",
			'th-th': "เอนเนอร์จี้แอทแทก",
			'ko-kr': "에너지어택"
		},

		damage: "40×",

		effect: {
			'ja-jp': "このポケモンについているエネルギーの数×40ダメージ。",
			'zh-tw': "造成這隻寶可夢身上附加的能量的數量×40點傷害。",
			'th-th': "แดเมจจะเท่ากับจำนวนพลังงานที่ติดอยู่กับโปเกมอนนี้ x40",
			'ko-kr': "이 포켓몬에게 붙어 있는 에너지의 개수 × 40데미지를 준다."
		}
	}],

	weaknesses: [{
		type: "Fighting",
		value: "×2"
	}],

	variants: [
		{
			type: "holo",
			thirdParty: {
				cardmarket: 741877,
				tcgplayer: 566010,
			},
		},
	],

	retreat: 2,
	regulationMark: "G",
}

export default card