import { Card } from "models/database/card"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		'ja-jp': "テツノツツミ",
		'th-th': "ถุงเหล็ก",
		'ko-kr': "무쇠보따리"
	},

	illustrator: "Teeziro",
	category: "Pokemon",
	dexId: [991],
	hp: 100,
	types: ["Water"],

	description: {
		'ja-jp': "古い 書物に 登場する 謎の 物体に 似た ポケモン。 目撃例は 過去 ２件のみ。",
		'th-th': "เป็นโปเกมอนที่มีความคล้ายคลึงกับวัตถุลึกลับที่ปรากฏในบันทึกเก่าแก่ ในอดีตมีข้อมูลว่ามีผู้พบเห็นเพียง 2 ครั้งเท่านั้น",
		'ko-kr': "오래된 서적에 등장하는 정체불명의 물체를 닮은 포켓몬. 목격된 사례는 과거에 단 2건뿐이다."
	},

	stage: "Basic",

	abilities: [{
		type: "Ability",

		name: {
			'ja-jp': "ハイパーブロアー",
			'th-th': "ไฮเปอร์โบลเวอร์",
			'ko-kr': "하이퍼 블로어"
		},

		effect: {
			'ja-jp': "このポケモンがベンチにいるなら、自分の番に1回使える。相手のバトルポケモンをベンチポケモンと入れ替える（バトル場に出すポケモンは相手が選ぶ）。その後、このポケモンと、ついているすべてのカードを、トラッシュする。",
			'th-th': "ถ้าโปเกมอนนี้อยู่บนเบนช์ ใช้ได้ 1 ครั้งในเทิร์นฝ่ายเรา สลับโปเกมอนบนตำแหน่งต่อสู้ฝ่ายตรงข้ามกับโปเกมอนบนเบนช์ (ฝ่ายตรงข้ามเลือกโปเกมอนที่จะวางบนตำแหน่งต่อสู้) หลังจากนั้น ทิ้งโปเกมอนนี้ และการ์ดทั้งหมดที่ติดอยู่ ที่ตำแหน่งทิ้งการ์ด",
			'ko-kr': "이 포켓몬이 벤치에 있다면 자신의 차례에 1번 사용할 수 있다. 상대의 배틀 포켓몬을 벤치 포켓몬과 교체한다(배틀필드로 내보낼 포켓몬은 상대가 선택한다). 그 뒤, 이 포켓몬과 붙어 있는 모든 카드를 트래쉬한다."
		}
	}],

	attacks: [{
		cost: ["Water", "Colorless", "Colorless"],

		name: {
			'ja-jp': "れいきゃくジェット",
			'th-th': "ไอพ่นคลายร้อน",
			'ko-kr': "냉각제트"
		},

		damage: 80,

		effect: {
			'ja-jp': "次の相手の番、このワザを受けた進化ポケモンは、ワザが使えない。",
			'th-th': "เทิร์นถัดไปของฝ่ายตรงข้าม โปเกมอนวิวัฒนาการที่ได้รับท่าต่อสู้นี้ จะใช้ท่าต่อสู้ไม่ได้",
			'ko-kr': "상대의 다음 차례에 이 기술을 받은 진화 포켓몬은 기술을 사용할 수 없다."
		}
	}],

	weaknesses: [{
		type: "Lightning",
		value: "×2"
	}],

	variants: [
		{
			type: "holo",
			thirdParty: {
				cardmarket: 741898,
				tcgplayer: 566031,
			},
		},
	],

	retreat: 1,
	regulationMark: "G"
}

export default card