import { Card } from "../../../interfaces"
import Set from "../sv5a"

const card: Card = {
	set: Set,

	name: {
		ja: "サバイブギプス",
		'zh-tw': "倖存鍛鍊器",
		th: "อุปกรณ์เพาะกายช่วยชีวิต"
	},

	illustrator: "inose yukie",
	category: "Trainer",

	effect: {
		ja: "このカードをつけているポケモンのHPがまんたんの状態で、相手のポケモンからワザのダメージを受けてきぜつするとき、そのポケモンはきぜつせず、残りHPが「10」の状態で場に残る。その後、このカードをトラッシュする。",
		'zh-tw': "附有這張卡的寶可夢的HP是全滿的狀態下，受到對手的寶可夢招式的傷害而【昏厥】時，那隻寶可夢不會【昏厥】，而是以剩餘HP為「10」的狀態留在場上。然後，將這張卡丟棄。",
		th: "ในตอนที่โปเกมอนที่ติดการ์ดนี้อยู่มี HP เต็ม และได้รับแดเมจของท่าต่อสู้จากโปเกมอนฝ่ายตรงข้ามและจะ[หมดสภาพ] โปเกมอนนั้นจะไม่[หมดสภาพ] และจะอยู่บนกระดานด้วย HP ที่เหลือ [10] หลังจากนั้น ทิ้งการ์ดนี้ที่ตำแหน่งทิ้งการ์ด"
	},

	trainerType: "Tool",
	regulationMark: "H"
}

export default card