import { Card } from "../../../interfaces"
import Set from "../SV5a"

const card: Card = {
	set: Set,

	name: {
		ja: "ブーメランエネルギー",
		'zh-tw': "回力鏢能量",
		th: "บูมเมอแรงเอนเนอร์จี้"
	},

	illustrator: "5ban Graphics",
	rarity: "Uncommon",
	category: "Energy",

	effect: {
		ja: "このカードは、ポケモンについているかぎり、エネルギー1個ぶんとしてはたらく。\n\nこのカードをつけているポケモンが使うワザの効果で、このカードがトラッシュされたなら、ワザのダメージや効果のあとに、もとのポケモンにつけなおす。",
		'zh-tw': "只要這張卡附於寶可夢身上，視為提供1個【無】能量。 若因附有這張卡的寶可夢使用的招式的效果使這張卡被丟棄，則在招式的傷害與效果的影響之後，重新附於原本的寶可夢身上。",
		th: "การ์ดนี้ ตราบใดที่ติดอยู่กับโปเกมอน จะทำงานเทียบเท่าพลังงาน[ไร้สี] 1 ลูก ถ้าการ์ดนี้ถูกทิ้งที่ตำแหน่งทิ้งการ์ด ด้วยเอฟเฟกต์ของท่าต่อสู้ที่โปเกมอนที่ติดการ์ดนี้อยู่ใช้ หลังจากทำแดเมจและเอฟเฟกต์ของท่าต่อสู้แล้ว นำไปติดที่โปเกมอนตัวเดิมอีกครั้ง"
	},

	energyType: "Special",
	regulationMark: "H"
}

export default card