import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "チオンジェン",
		'zh-tw': "古簡蝸",
		th: "ฉงเจี่ยน",
		ko: "총지엔"
	},

	illustrator: "Kouki Saitou",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [1001],
	hp: 130,
	types: ["Grass"],

	description: {
		ja: "草木の エネルギーを 吸い上げる。 周囲の 森は たちどころに 枯れ果て 田畑は 不作となる。",
		'zh-tw': "會吸取草木的能量，使周圍的森林霎時乾枯，田地的農作物歉收。",
		th: "ดูดพลังงานของต้นไม้ใบหญ้า ทำให้ป่าไม้โดยรอบเหี่ยวเฉาอย่างรวดเร็วและไร่นาไม่ค่อยออกผล",
		ko: "초목의 에너지를 흡수한다. 주위의 숲은 금세 말라비틀어지며 논밭에는 흉작이 들게 된다."
	},

	stage: "Basic",

	attacks: [{
		cost: ["Grass"],

		name: {
			ja: "リーフブリング",
			'zh-tw': "綠葉到來",
			th: "เบิกใบไม้",
			ko: "리프브링"
		},

		effect: {
			ja: "自分のトラッシュから「基本エネルギー」を2枚まで選び、自分のポケモン1匹につける。",
			'zh-tw': "從自己的棄牌區選擇最多2張「基本【草】能量」卡，附於自己的1隻寶可夢身上。",
			th: "เลือกการ์ด [พลังงานพื้นฐาน[หญ้า]] ได้สูงสุด 2 ใบจากตำแหน่งทิ้งการ์ดฝ่ายเรา ติดที่โปเกมอนฝ่ายเรา 1 ตัว",
			ko: "자신의 트래쉬에서 「기본 (풀) 에너지」를 2장까지 선택해서 자신의 포켓몬 1마리에게 붙인다."
		}
	}, {
		cost: ["Grass", "Grass", "Grass", "Colorless"],

		name: {
			ja: "どんよくバインド",
			'zh-tw': "貪欲制約",
			th: "โลภมากมัดติด",
			ko: "탐욕바인드"
		},

		damage: 140,

		effect: {
			ja: "次の相手の番、このワザを受けたポケモンは、ワザを使うためのエネルギーが、エネルギー2個ぶん多くなる。",
			'zh-tw': "在下個對手的回合，受到這個招式的寶可夢使用招式所需的能量增加2個【無】能量。",
			th: "เทิร์นถัดไปของฝ่ายตรงข้าม โปเกมอนที่ได้รับท่าต่อสู้นี้ พลังงานสำหรับใช้ท่าต่อสู้ จะใช้พลังงาน[ไร้สี]เพิ่มขึ้น 2 ลูก",
			ko: "상대의 다음 차례에 이 기술을 받은 포켓몬은 기술을 사용하기 위한 에너지가 (무색) 에너지 2개만큼 많아진다."
		}
	}],

	weaknesses: [{
		type: "Fire",
		value: "×2"
	}],

	retreat: 3,
	regulationMark: "G"
}

export default card