import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "テツノドクガ",
		'zh-tw': "鐵毒蛾",
		th: "แมลงมอธเหล็ก",
		ko: "무쇠독나방"
	},

	illustrator: "Kouki Saitou",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [994],
	hp: 130,
	types: ["Fire"],

	description: {
		ja: "捕獲例は ゼロ。 データ不足。 古い 書物に 記された 物体と 特徴が 一致。",
		'zh-tw': "無捕獲記錄。資料不足。其特徵與老舊的書籍裡所記載的物體一致。",
		th: "ข้อมูลไม่เพียงพอและไม่เคยมีข้อมูลว่าถูกจับมาก่อน มีลักษณะเด่นตรงกับวัตถุที่อธิบายไว้ในบันทึกเก่าแก่",
		ko: "포획된 사례는 없으며 데이터도 부족하다. 오래된 서적에 기록된 물체와 특징이 일치한다."
	},

	stage: "Basic",

	abilities: [{
		type: "Ability",

		name: {
			ja: "サーマルリアクター",
			'zh-tw': "熱流反應者",
			th: "เครื่องปฏิกรณ์ความร้อน",
			ko: "서멀 리액터"
		},

		effect: {
			ja: "自分の番に、このポケモンがベンチからバトル場に出たとき、1回使える。自分の場のポケモンについているエネルギーを好きなだけ選び、このポケモンにつけ替える。",
			'zh-tw': "在自己的回合，從備戰區將這隻寶可夢放置於戰鬥場時，可使用1次。選擇自己的場上寶可夢身上附加的任意數量的【火】能量卡，改附於這隻寶可夢身上。",
			th: "ในเทิร์นฝ่ายเรา เมื่อโปเกมอนนี้ออกจากเบนช์มาที่ตำแหน่งต่อสู้ ใช้ได้ 1 ครั้ง เลือกพลังงาน[ไฟ]ที่ติดอยู่กับโปเกมอนบนกระดานฝ่ายเราตามจำนวนที่ชอบ ย้ายมาติดกับโปเกมอนนี้",
			ko: "자신의 차례에 이 포켓몬이 벤치에서 배틀필드로 나왔을 때 1번 사용할 수 있다. 자신의 필드의 포켓몬에게 붙어 있는 (불꽃) 에너지를 원하는 만큼 선택해서 이 포켓몬에게 붙인다."
		}
	}],

	attacks: [{
		cost: ["Fire", "Fire", "Colorless"],

		name: {
			ja: "ねっせん",
			'zh-tw': "高熱光線",
			th: "ลำแสงร้อนจี๋",
			ko: "열선"
		},

		damage: 120,

		effect: {
			ja: "次の自分の番、このポケモンは「ねっせん」が使えない。",
			'zh-tw': "在下個自己的回合，這隻寶可夢無法使用「高熱光線」。",
			th: "เทิร์นถัดไปของฝ่ายเรา โปเกมอนนี้จะใช้ [ลำแสงร้อนจี๋] ไม่ได้",
			ko: "자신의 다음 차례에 이 포켓몬은 「열선」을 사용할 수 없다."
		}
	}],

	weaknesses: [{
		type: "Water",
		value: "×2"
	}],

	retreat: 2,
	regulationMark: "G"
}

export default card