import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "ゼブライカ",
		'zh-tw': "雷電斑馬",
		th: "ซีบรายกา",
		ko: "제브라이카"
	},

	illustrator: "GOSSAN",
	rarity: "Uncommon",
	category: "Pokemon",
	dexId: [523],
	hp: 120,
	types: ["Lightning"],

	description: {
		ja: "稲妻のような 瞬発力。 ゼブライカが 全速力で 走ると 雷鳴が 響きわたる。",
		'zh-tw': "有著閃電般的爆發力。如果雷電斑馬全速奔馳，雷聲就會響徹雲霄。",
		th: "มีพลังพุ่งตัวชั่วพริบตาเหมือนสายฟ้า เมื่อซีบรายกาวิ่งเต็มกำลัง จะเกิดเสียงฟ้าร้องกึกก้อง",
		ko: "천둥번개 같은 순발력을 가지고 있다. 제브라이카가 전속력으로 달리면 천둥소리가 울려 퍼진다."
	},

	stage: "Stage1",

	attacks: [{
		cost: ["Lightning"],

		name: {
			ja: "はじけるいななき",
			'zh-tw': "濺射嘶鳴",
			th: "ม้าร้องระเบิด",
			ko: "터뜨린울음"
		},

		effect: {
			ja: "相手がすでにとったサイドの枚数ぶんまで、自分のトラッシュから「基本エネルギー」を選び、自分のポケモンに好きなようにつける。",
			'zh-tw': "從自己的棄牌區選擇最多與對手已經獲得的獎賞卡的張數相同數量的「基本【雷】能量」卡，以任意方式附於自己的寶可夢身上。",
			th: "เลือกการ์ด [พลังงานพื้นฐาน[สายฟ้า]] จากตำแหน่งทิ้งการ์ดฝ่ายเรา ได้สูงสุดไม่เกินจำนวนการ์ดรางวัลที่ฝ่ายตรงข้ามหยิบไปแล้ว ติดที่โปเกมอนฝ่ายเราตามชอบ",
			ko: "상대가 이미 가져간 프라이즈의 장수만큼까지 자신의 트래쉬에서 「기본 (번개) 에너지」를 선택해서 자신의 포켓몬에게 원하는 대로 붙인다."
		}
	}, {
		cost: ["Lightning", "Colorless", "Colorless"],

		name: {
			ja: "かみなり",
			'zh-tw': "打雷",
			th: "ฟ้าผ่า",
			ko: "번개"
		},

		damage: 150,

		effect: {
			ja: "このポケモンにも50ダメージ。",
			'zh-tw': "這隻寶可夢也受到50點傷害。",
			th: "โปเกมอนนี้ก็จะได้รับแดเมจ 50 ด้วย",
			ko: "이 포켓몬에게도 50데미지를 준다."
		}
	}],

	weaknesses: [{
		type: "Fighting",
		value: "×2"
	}],

	retreat: 1,
	regulationMark: "G",

	thirdParty: {
		cardmarket: 741851
	}
}

export default card