import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "ブーストエナジー 未来",
		'zh-tw': "驅勁能量 未來",
		th: "บูสต์เอนเนอร์จี้ อนาคต",
		ko: "부스트에너지 미래"
	},

	illustrator: "5ban Graphics",
	rarity: "Uncommon",
	category: "Trainer",

	effect: {
		ja: "このカードをつけている「未来」のポケモンは、にげるためのエネルギーがすべてなくなり、そのポケモンが使うワザの、相手のバトルポケモンへのダメージは「+20」される。",
		'zh-tw': "附有這張卡的「未來」寶可夢【撤退】所需的能量全部消除，那隻寶可夢使用的招式，對對手的戰鬥寶可夢造成的傷害「+20」點。",
		th: "โปเกมอน [อนาคต] ที่ติดการ์ดนี้อยู่ พลังงานสำหรับ[หนี]ทั้งหมดจะหายไป แดเมจของท่าต่อสู้ที่โปเกมอนนั้น ใช้ทำกับโปเกมอนบนตำแหน่งต่อสู้ฝ่ายตรงข้ามจะถูก [+20]",
		ko: "이 카드를 붙이고 있는 「미래」의 포켓몬은 후퇴에 필요한 에너지가 모두 없어지고 그 포켓몬이 사용하는 기술이 상대의 배틀 포켓몬에게 주는 데미지는 「+20」이 된다."
	},

	trainerType: "Tool",
	regulationMark: "G"
}

export default card