import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "ワザマシン エヴォリューション",
		'zh-tw': "招式學習器 演進",
		th: "แมชชีนท่าต่อสู้ อีโวลูชัน",
		ko: "저주의 먼지떨이"
	},

	illustrator: "Studio Bora Inc.",
	rarity: "Uncommon",
	category: "Trainer",

	effect: {
		ja: "このカードをつけているポケモンは、このカードに書かれているワザを使える。［ワザを使うためのエネルギーは必要。］\nポケモンについているこのカードは、自分の番の終わりにトラッシュする。",
		'zh-tw': "附有這張卡的寶可夢，可使用這張卡上寫的招式。[需要有足夠使用招式的能量。]將附於寶可夢身上的這張卡，在自己的回合結束時丟棄。",
		th: "โปเกมอนที่ติดการ์ดนี้อยู่ สามารถใช้ท่าต่อสู้ที่เขียนอยู่บนการ์ดนี้ได้ {จำเป็นต้องใช้พลังงานสำหรับใช้ท่าต่อสู้} การ์ดนี้ที่ติดอยู่กับโปเกมอน จะทิ้งที่ตำแหน่งทิ้งการ์ดเมื่อจบเทิร์นฝ่ายเรา",
		ko: "이 카드를 붙이고 있는 포켓몬이 상대의 포켓몬으로부터 기술의 데미지를 받아 기절했을 때 상대의 패에서 앞면을 보지 않고 1장 선택해서 트래쉬한다."
	},

	trainerType: "Tool",
	regulationMark: "G"
}

export default card