import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "クエスパトラ",
		th: "เควสพัตรา",
		ko: "클레스퍼트라"
	},

	illustrator: "AKIRA EGAWA",
	category: "Pokemon",
	dexId: [956],
	hp: 120,
	types: ["Psychic"],

	description: {
		ja: "色とりどりの フリルの 隙間から サイコパワーを 放出して 時速２００キロで 疾走する。",
		th: "ปล่อยพลังจิตออกจากช่องว่างของจีบระบายหลากสีสันและวิ่งด้วยความเร็ว 200 กิโลเมตรต่อชั่วโมง",
		ko: "형형색색의 프릴 사이사이로 사이코 파워를 방출하며 시속 200km로 질주한다."
	},

	stage: "Stage1",

	abilities: [{
		type: "Ability",

		name: {
			ja: "みきわめ",
			th: "เพ่งพินิจ",
			ko: "본질밝히기"
		},

		effect: {
			ja: "自分の番に、このカードを手札から出して進化させたとき、1回使える。次の相手の番の終わりまで、このポケモンは、相手のポケモンからワザのダメージや効果を受けない。",
			th: "ในเทิร์นฝ่ายเรา เมื่อนำการ์ดนี้จากบนมือออกมาวิวัฒนาการแล้ว ใช้ได้ 1 ครั้ง จนกว่าจะจบเทิร์นถัดไปของฝ่ายตรงข้าม โปเกมอนนี้จะไม่ได้รับแดเมจและเอฟเฟกต์ของท่าต่อสู้จากโปเกมอนฝ่ายตรงข้าม",
			ko: "자신의 차례에 이 카드를 패에서 꺼내서 진화시켰을 때 1번 사용할 수 있다. 상대의 다음 차례가 끝날 때까지 이 포켓몬은 상대의 포켓몬으로부터 기술의 데미지나 효과를 받지 않는다."
		}
	}],

	attacks: [{
		cost: ["Psychic", "Psychic"],

		name: {
			ja: "グリッターアイズ",
			th: "เนตรแวววาว",
			ko: "글리터아이즈"
		},

		damage: "70+",

		effect: {
			ja: "自分のトラッシュに「リップ」があるなら、70ダメージ追加。",
			th: "ถ้ามีการ์ด [ลิป] บนตำแหน่งทิ้งการ์ดฝ่ายเรา การโจมตีนี้จะเพิ่มแดเมจอีก 70",
			ko: "자신의 트래쉬에 「리파」가 있다면 70데미지를 추가한다."
		}
	}],

	weaknesses: [{
		type: "Darkness",
		value: "×2"
	}],

	resistances: [{
		type: "Fighting",
		value: "-30"
	}],

	retreat: 1,
	regulationMark: "G"
}

export default card