import { Card } from "../../../interfaces"
import Set from "../SV4M"

const card: Card = {
	set: Set,

	name: {
		ja: "ポリゴンZ",
		th: "โพรีกอน-แซด",
		ko: "폴리곤Z"
	},

	illustrator: "GOSSAN",
	category: "Pokemon",
	dexId: [474],
	hp: 150,
	types: ["Colorless"],

	description: {
		ja: "追加 プログラムで 進化したと 言われるが ほんとうに 進化なのか 学会でも 意見が 分かれる。",
		th: "#N/A",
		ko: "추가 프로그램으로 진화했다고 전해지지만 정말 진화인 건지 학회에서도 의견이 나뉜다."
	},

	stage: "Stage2",

	abilities: [{
		type: "Ability",

		name: {
			ja: "バグターボ",
			th: "บั๊กเทอร์โบ",
			ko: "버그 터보"
		},

		effect: {
			ja: "自分の番に1回使える。コインを1回投げオモテなら、自分のトラッシュから基本エネルギーを4枚まで選び、このポケモンにつける。ウラなら、このポケモンについているエネルギーを1個選び、トラッシュする。",
			th: "ใช้ได้ 1 ครั้งในเทิร์นฝ่ายเรา ทอยเหรียญ 1 ครั้งถ้าออกหัว เลือกการ์ดพลังงานพื้นฐานได้สูงสุด 4 ใบจากตำแหน่งทิ้งการ์ดฝ่ายเรา ติดที่โปเกมอนนี้ ถ้าออกก้อย เลือกพลังงานที่ติดอยู่กับโปเกมอนนี้ 1 ลูก ทิ้งที่ตำแหน่งทิ้งการ์ด",
			ko: "자신의 차례에 1번 사용할 수 있다. 동전을 1번 던져서 앞면이 나오면 자신의 트래쉬에서 기본 에너지를 4장까지 선택해서 이 포켓몬에게 붙인다. 뒷면이 나오면 이 포켓몬에게 붙어 있는 에너지를 1개 선택해서 트래쉬한다."
		}
	}],

	attacks: [{
		cost: ["Colorless"],

		name: {
			ja: "エナジーアタック",
			th: "เอนเนอร์จี้แอทแทก",
			ko: "에너지어택"
		},

		damage: "40×",

		effect: {
			ja: "このポケモンについているエネルギーの数×40ダメージ。",
			th: "แดเมจจะเท่ากับจำนวนพลังงานที่ติดอยู่กับโปเกมอนนี้ x40",
			ko: "이 포켓몬에게 붙어 있는 에너지의 개수 × 40데미지를 준다."
		}
	}],

	weaknesses: [{
		type: "Fighting",
		value: "×2"
	}],

	retreat: 2,
	regulationMark: "G",

	thirdParty: {
		cardmarket: 741877
	}
}

export default card