import { Card } from "../../../interfaces"
import Set from "../SV7"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "壯偉碩木",
		'zh-cn': "壯偉碩木",
		ja: "偉大な大樹"
	},

	illustrator: "AYUMI ODASHIMA",
	category: "Trainer",

	effect: {
		'zh-tw': "雙方玩家在每個自己的回合時，可使用1次，可從自己的牌庫選擇1張從自己的場上的1隻【基礎】寶可夢進化而來的【1階進化】寶可夢卡，放置於那隻寶可夢身上完成進化。若進化了，則可繼續選擇1張【2階進化】寶可夢卡，完成進化。並且重洗牌庫。（自己的最初回合或剛使出的【基礎】寶可夢無法完成進化。）",
		'zh-cn': "雙方玩家在每個自己的回合時，可使用1次，可從自己的牌庫選擇1張從自己的場上的1隻【基礎】寶可夢進化而來的【1階進化】寶可夢卡，放置於那隻寶可夢身上完成進化。若進化了，則可繼續選擇1張【2階進化】寶可夢卡，完成進化。並且重洗牌庫。（自己的最初回合或剛使出的【基礎】寶可夢無法完成進化。）",
		ja: "おたがいのプレイヤーは、自分の番ごとに1回、自分の場のたねポケモン1匹から進化する1進化ポケモンを、自分の山札から1枚選び、そのポケモンにのせて進化させてよい。進化したなら、続けて2進化ポケモンを1枚選び、進化させてよい。そして山札を切る。（最初の自分の番や、出したばかりのたねポケモンは進化させられない。）"
	},

	trainerType: "Stadium",
	regulationMark: "H",
	rarity: "None"
}

export default card