import { Card } from "../../../interfaces"
import Set from "../S5I"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "一擊能量",
		th: "พลังงานจู่โจมครั้งเดียว"
	},

	category: "Energy",

	effect: {
		'zh-tw': "這張卡只可附於「一擊」寶可夢身上，若附於「一擊」寶可夢以外的寶可夢身上，則將其丟棄。 只要這張卡附於寶可夢身上，視為提供1個【鬥】【惡】2種屬性的能量，附有這張卡的寶可夢使用的招式，對對手的戰鬥寶可夢造成的傷害「+20」點。",
		th: "การ์ดนี้สามารถติดได้ที่โปเกมอน เท่านั้น ถ้าติดอยู่ที่โปเกมอนอื่นนอกเหนือจาก ให้ทิ้งที่ตำแหน่งทิ้งการ์ด การ์ดนี้ ตราบใดที่ยังติดอยู่กับโปเกมอน จะทำงานเทียบเท่าพลังงาน 1 ลูกใน 2 ประเภทนี้ [ต่อสู้] [ความมืด] แดเมจของท่าต่อสู้ที่โปเกมอนที่ติดการ์ดนี้ใช้ทำกับโปเกมอนบนตำแหน่งต่อสู้ฝ่ายตรงข้ามจะถูก [+20]"
	},

	energyType: "Special",
	regulationMark: "E"
}

export default card