import { Card } from "models/database/card"
import Set from "../SV4K"

const card: Card = {
	set: Set,

	name: {
		'ja-jp': "ミガルーサ",
		'th-th': "มิกาลูซา",
		'ko-kr': "가비루사"
	},

	illustrator: "Shibuzoh.",
	category: "Pokemon",
	dexId: [976],
	hp: 120,
	types: ["Water"],

	description: {
		'ja-jp': "無駄な 肉を 捨て去ると 心が 研ぎ澄まされ サイコパワーが 上がる。 贅肉は 淡白だが 美味しい。",
		'th-th': "จิตใจจะถูกขัดเกลาและพลังจิตจะสูงขึ้นเมื่อละทิ้งกายเนื้อที่ไม่จำเป็น ไขมันส่วนเกินสีขาวอ่อนนั้นมีรสชาติดี",
		'ko-kr': "불필요한 살을 분리하면 정신이 예민해져 사이코 파워가 상승한다. 떨어진 살은 담백하고 맛있다."
	},

	stage: "Basic",

	abilities: [{
		type: "Ability",

		name: {
			'ja-jp': "みをきるおもい",
			'th-th': "ยอมแลกด้วยเลือดเนื้อ",
			'ko-kr': "살을 깎는 마음"
		},

		effect: {
			'ja-jp': "このポケモンが、バトル場で相手のポケモンからワザのダメージを受けてきぜつしたとき、このポケモンについているエネルギーを2枚まで選び、ベンチポケモン1匹につけ替える。",
			'th-th': "เมื่อโปเกมอนนี้ อยู่บนตำแหน่งต่อสู้และได้รับแดเมจของท่าต่อสู้จากโปเกมอนฝ่ายตรงข้ามและ[หมดสภาพ]แล้ว เลือกการ์ดพลังงาน[น้ำ]ที่ติดอยู่กับโปเกมอนนี้ได้สูงสุด 2 ใบ ย้ายไปติดกับโปเกมอนบนเบนช์ 1 ตัว",
			'ko-kr': "이 포켓몬이 배틀필드에서 상대의 포켓몬으로부터 기술의 데미지를 받아 기절했을 때 이 포켓몬에게 붙어 있는 (물) 에너지를 2장까지 선택해서 벤치 포켓몬 1마리에게 붙인다."
		}
	}],

	attacks: [{
		cost: ["Colorless", "Colorless", "Colorless"],

		name: {
			'ja-jp': "ハイドロポンプ",
			'th-th': "ไฮโดรปั๊มพ์",
			'ko-kr': "하이드로펌프"
		},

		damage: "60+",

		effect: {
			'ja-jp': "このポケモンについているエネルギーの数×20ダメージ追加。",
			'th-th': "แดเมจจะเพิ่มตามจำนวนพลังงาน[น้ำ]ที่ติดอยู่กับโปเกมอนนี้ x20",
			'ko-kr': "이 포켓몬에게 붙어 있는 (물) 에너지의 개수 × 20데미지를 추가한다."
		}
	}],

	weaknesses: [{
		type: "Lightning",
		value: "×2"
	}],

	variants: [
		{
			type: "holo",
			thirdParty: {
				cardmarket: 741472,
				tcgplayer: 565825,
			},
		},
	],

	retreat: 2,
	regulationMark: "G"
}

export default card