import { Card } from "../../../interfaces"
import Set from "../SV5K"

const card: Card = {
	set: Set,

	name: {
		ja: "エルフーン",
		'zh-tw': "風妖精",
		th: "เอลฟูน",
		ko: "엘풍"
	},

	illustrator: "Mizue",
	rarity: "Rare",
	category: "Pokemon",
	dexId: [547],
	hp: 100,
	types: ["Grass"],

	description: {
		ja: "綿を まき散らし イタズラする。 水を かけると 重くなって 動けなくなり 観念するぞ。",
		'zh-tw': "喜歡到處撒棉花搗蛋。沾水之後就會變重而 動彈不得，只能聽天由命。",
		th: "โปรยนุ่นเพื่อแกล้ง เมื่อราดน้ำจะหนักจนขยับไม่ได้แล้วถึงสำนึก",
		ko: "솜을 흩뿌리며 장난을 친다. 물을 끼얹으면 무거워져서 움직일 수 없게 되어 포기한다."
	},

	stage: "Stage1",

	abilities: [{
		type: "Ability",

		name: {
			ja: "かるがるヒール",
			'zh-tw': "柔柔治癒",
			th: "รักษาง่าย ๆ",
			ko: "사뿐사뿐 힐"
		},

		effect: {
			ja: "自分の番に、このカードを手札から出して進化させたとき、1回使える。自分のバトル場のポケモンのHPを、すべて回復する。その後、回復したポケモンについているエネルギーを、すべてトラッシュする。",
			'zh-tw': "在自己的回合，從手牌使出這張卡並完成進化時，可使用1次。將自己的戰鬥場的【草】寶可夢的HP全部恢復。然後，將恢復的寶可夢身上附加的能量全部丟棄。",
			th: "ในเทิร์นฝ่ายเรา เมื่อนำการ์ดนี้จากบนมือออกมาวิวัฒนาการแล้ว ใช้ได้ 1 ครั้ง ฟื้นฟู HP ทั้งหมดของโปเกมอน[หญ้า]บนตำแหน่งต่อสู้ฝ่ายเรา หลังจากนั้น ทิ้งพลังงานที่ติดอยู่กับโปเกมอนที่ฟื้นฟู ทั้งหมดที่ตำแหน่งทิ้งการ์ด",
			ko: "자신의 차례에 이 카드를 패에서 꺼내서 진화시켰을 때 1번 사용할 수 있다. 자신의 배틀필드의 (풀) 포켓몬의 HP를 모두 회복한다. 그 뒤, 회복한 포켓몬에게 붙어 있는 에너지를 모두 트래쉬한다."
		}
	}],

	attacks: [{
		cost: ["Grass"],

		name: {
			ja: "タネばくだん",
			'zh-tw': "種子炸彈",
			th: "ระเบิดเมล็ดพืช",
			ko: "씨폭탄"
		},

		damage: 40
	}],

	weaknesses: [{
		type: "Fire",
		value: "×2"
	}],

	retreat: 1,
	regulationMark: "H",

	thirdParty: {
		cardmarket: 752750
	}
}

export default card