import { Card } from "../../../interfaces"
import Set from "../sv5K"

const card: Card = {
	set: Set,

	name: {
		ja: "ネオアッパーエネルギー",
		'zh-tw': "新衝天能量",
		th: "นีโออัปเปอร์เอนเนอร์จี้",
		'zh-cn': "新衝天能量"
	},

	category: "Energy",

	effect: {
		ja: "このカードは、ポケモンについているかぎり、エネルギー1個ぶんとしてはたらく。\n\n2進化ポケモンについているなら、すべてのタイプのエネルギー2個ぶんとしてはたらく。",
		'zh-tw': "只要這張卡附於寶可夢身上，視為提供1個【無】能量。 若附於【2階進化】寶可夢身上，則視為提供2個所有屬性的能量。",
		th: "การ์ดนี้ ตราบใดที่ติดอยู่กับโปเกมอน จะทำงานเทียบเท่าพลังงาน[ไร้สี] 1 ลูก ถ้าติดอยู่กับโปเกมอน[ร่าง2] จะทำงานเทียบเท่าพลังงานทุกประเภท 2 ลูก",
		'zh-cn': "只要這張卡附於寶可夢身上，視為提供1個【無】能量。 若附於【2階進化】寶可夢身上，則視為提供2個所有屬性的能量。"
	},

	energyType: "Special",
	regulationMark: "H"
}

export default card