import { Card } from "../../../interfaces"
import Set from "../S12"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "四尖石",
		th: "หินสี่แฉก"
	},

	illustrator: "sadaji",
	category: "Trainer",

	effect: {
		'zh-tw': "「四尖石」卡可使用1張或者4張同時使用，依據使用張數效果有所不同。◆若使用1張，則將自己的戰鬥寶可夢恢復「10」HP。 ◆若同時使用4張，則將自己的所有寶可夢的HP全部恢復。（這個效果4張生效1次。）",
		th: "การ์ด [หินสี่แฉก] สามารถใช้ 1 ใบหรือ 4 ใบพร้อมกัน เอฟเฟกต์จะต่างกันตามจำนวนใบที่ใช้ ◆ถ้าใช้ 1 ใบ ฟื้นฟู HP ของโปเกมอนบนตำแหน่งต่อสู้ฝ่ายเรา [10] ◆ถ้าใช้ 4 ใบพร้อมกัน ฟื้นฟู HP ทั้งหมดของโปเกมอนฝ่ายเราทุกตัว (เอฟเฟกต์นี้ การ์ด 4 ใบจะทำงาน 1 ครั้ง)"
	},

	trainerType: "Item",
	regulationMark: "F"
}

export default card