import { Card } from "../../../interfaces"
import Set from "../S12"

const card: Card = {
	set: Set,

	name: {
		'zh-tw': "回血能量",
		th: "พลังงานฟื้นคืน",
		ja: "リゲインエネルギー"
	},

	illustrator: "aky CG Works",
	category: "Energy",

	effect: {
		'zh-tw': "只要這張卡附於寶可夢身上，視為提供1個【無】能量。 每次將附有這張卡的「寶可夢【V】」進化成從手牌使出的寶可夢時，將那隻寶可夢恢復「100」HP。",
		th: "การ์ดนี้ ตราบใดที่ติดอยู่กับโปเกมอน จะทำงานเทียบเท่าพลังงาน[ไร้สี] 1 ลูก ทุกครั้งที่ทำให้ [โปเกมอน【V】] ที่ติดการ์ดนี้อยู่วิวัฒนาการเป็นโปเกมอนที่นำออกมาจากบนมือ ให้ฟื้นฟู HP ของโปเกมอนนั้น [100]",
		ja: "このカードは、ポケモンについているかぎり、エネルギー1個ぶんとしてはたらく。\n\nこのカードをつけている「ポケモンV」を、手札から出したポケモンに進化させるたび、そのポケモンのHPを「100」回復する。"
	},

	energyType: "Special",
	regulationMark: "F",
	rarity: "Uncommon"
}

export default card