import { Card } from "../../../interfaces"
import Set from "../SV3"

const card: Card = {
	set: Set,

	name: {
		ja: "オモダカ",
		'zh-tw': "也慈",
		th: "โอโมดากะ [ซัพพอร์ต]"
	},

	illustrator: "kirisAki",
	category: "Trainer",

	effect: {
		ja: "このカードを使った番の終わりまで、自分のポケモン全員は、ワザが使えない。（新しく場に出したポケモンもふくむ。）\n\n自分の山札から基本エネルギーを2枚まで選び、自分のポケモン1匹につける。そして山札を切る。",
		'zh-tw': "在使用了這張卡的回合結束前，自己的所有寶可夢無法使用招式。（包含新上場的寶可夢。） 從自己的牌庫選擇最多2張基本能量卡，附於自己的1隻寶可夢身上。並且重洗牌庫。",
		th: "จนกว่าจะจบเทิร์นที่ใช้การ์ดนี้ โปเกมอนฝ่ายเราทุกตัว จะใช้ท่าต่อสู้ไม่ได้ (รวมถึงโปเกมอนที่เพิ่งออกมาใหม่บนกระดาน) เลือกการ์ดพลังงานพื้นฐานได้สูงสุด 2 ใบจากสำรับการ์ดฝ่ายเรา ติดที่โปเกมอนฝ่ายเรา 1 ตัว แล้วสับสำรับการ์ด"
	},

	trainerType: "Supporter",
	regulationMark: "G"
}

export default card